Revit 2027 API
RebarRoundingManager.TotalLengthRounding Property
 The rounding for Bar Length and Total Bar Length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalLengthRounding { get; set; }
Public Property TotalLengthRounding As Double
	Get
	Set
public:
property double TotalLengthRounding {
	double get ();
	void set (double value);
}
member TotalLengthRounding : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for value is not a number
ArgumentOutOfRangeException |  When setting this property: The rounding value is not a positive value.
InvalidOperationException |  When setting this property: IsActiveOnElement property is false.
Remarks
 IsActiveOnElement property has to be true. TotalLengthRounding is meaningless if IsActiveOnElement is false.
See Also
Reference
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace